Notflyabird/ESP32-S3/sdkconfig.defaults
# ============================================================
# ESP32-S3 N16R8 Configuration
# Target: ESP32-S3, 16MB Flash + 8MB OPI PSRAM
# ESP-IDF v5.3.5
# ============================================================

# --- Target ---
CONFIG_IDF_TARGET="esp32s3"

# --- Partition Table ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_custom.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_custom.csv"

# --- SPI Flash (16MB, QIO) ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_DETECT=n

# --- PSRAM (8MB OPI) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# --- FreeRTOS ---
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_OPTIMIZED_SCHEDULER=y

# --- I2S ---
CONFIG_I2S_ISR_IRAM_SAFE=y
CONFIG_I2S_SUPPRESS_DEPRECATE_WARN=y

# --- ESP-SR (Speech Recognition) ---
# AFE
CONFIG_AFE_ENABLE_VAD=y
CONFIG_AFE_ENABLE_WN=y
CONFIG_AFE_ENABLE_SE=y

# WakeNet9
CONFIG_WN_MODEL_WN9=y
CONFIG_WN_MODEL_WN9_NIHAOXIAOZHI=y
CONFIG_WN_MODEL_WN9_HILEXIN=n
CONFIG_WN_MODEL_WN9_HIESPRESSIF=n
CONFIG_WN_MODEL_WN9_CUSTOMWORD=n

# MultiNet (Chinese Commands)
CONFIG_MN_MODEL_MULTINET3=y
CONFIG_MN_CN_MODEL=y
CONFIG_MN_EN_MODEL=n
CONFIG_ESP_SR_MULTINET_CUSTOM_COMMANDS="计分器;地主加一分;地主加两分;玩家一加一分"

# --- SPIFFS (for model storage) ---
CONFIG_SPIFFS_CACHE=y
CONFIG_SPIFFS_CACHE_WR=y
CONFIG_SPIFFS_PAGE_SIZE=256
CONFIG_SPIFFS_OBJ_NAME_LEN=64
CONFIG_SPIFFS_USE_MTIME=y

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# --- Stack / Heap ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15
